# AreaScheme Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Area..::..AreaScheme Property
Area Class See Also
---
The area scheme.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AreaScheme AreaScheme { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AreaScheme As AreaScheme
	Get
```

Visual C++
---
```text
public:
property AreaScheme^ AreaScheme {
	AreaScheme^ get ();
}
```

# See Also
Area Class
Autodesk.Revit.DB Namespace